#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыРодителя 	= Справочники.тг_Объект.ПолучитьРеквизиты(Родитель);

	Если Не ЗначениеЗаполнено(Объект1С) 
		И Тип = Перечисления.тг_ТипыОбъектов.Сообщение 
		И Тип = РеквизитыРодителя.Тип Тогда

		Если Чат <> РеквизитыРодителя.Чат Тогда
			Объект1С = РеквизитыРодителя.Объект1С;
			ДополнительныеСвойства.Вставить("СинхронизироватьСообщения");
		КонецЕсли;

	КонецЕсли;

	сч = 0;
	Пока ДополнительныеРеквизиты.Количество() > сч Цикл
		СтрокаТЧ = ДополнительныеРеквизиты.Получить(сч);
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Строка) И Не ЗначениеЗаполнено(СтрокаТЧ.Значение) Тогда
			ДополнительныеРеквизиты.Удалить(сч);
		Иначе
			сч = сч + 1;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если Тип = ПредопределенноеЗначение("Перечисление.тг_ТипыОбъектов.Сообщение") И ПометкаУдаления Тогда
		тг_Сервер.УдалитьСообщение(Ссылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли