
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыОбъекта = Справочники.тг_Объект.ПолучитьРеквизиты(Объект.Ссылка);
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылки;

	ОбновитьЗаголовокОбъект1С();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура Объект1СОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуПользователей" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.Пользователи.ФормаСписка",Новый Структура("РежимВыбора",Истина),ЭтотОбъект,,,,
			Новый ОписаниеОповещения("ПослеВыбораПользователя",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПользователя(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Объект1С = ПолучитьНавигационнуюСсылку(Результат);
	
	ОбновитьЗаголовокОбъект1С();
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ОбновитьЗаголовокОбъект1С()

	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Объект 1С: "));
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Объект.Объект1С);
			
	МассивСсылок = ПолучитьПредставленияНавигационныхСсылок(МассивСсылок);
	Если МассивСсылок.Количество() Тогда
		ТекстСсылки = МассивСсылок[0].Текст;
	Иначе
		ТекстСсылки = "Ссылка";
	КонецЕсли;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ТекстСсылки,, ЦветГиперссылки,, Объект.Объект1С));
	МассивСтрок.Добавить(Символы.Таб);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("...",,ЦветГиперссылки,,"ОткрытьФормуПользователей"));
	
	Элементы.Объект1С.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);

КонецПроцедуры
