
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыОбъекта = Справочники.тг_Объект.ПолучитьРеквизиты(Объект.Ссылка);
	
	РеквизитыОбъекта.Свойство("Токен"	, Токен);
	Если НЕ ПустаяСтрока(Токен) Тогда
		Вебхук = СтрЗаменить(тг_Сервер.ПолучитьВебхук(Токен),"/" + Объект.Код,"");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	ТокенПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВебхукПриИзменении(Элемент)
	ВебхукПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТокенПриИзмененииНаСервере()

	ДанныеБота = тг_Сервер.ПолучитьДанныеБота(Токен);
	РеквизитыОбъекта = Справочники.тг_Объект.ЗаполнитьРеквизиты(ДанныеБота);
	
	Если Не РеквизитыОбъекта.Свойство("Код",Объект.Код) Тогда
		Токен = "";
		Возврат;
	КонецЕсли;
	
	РеквизитыОбъекта.Свойство("Наименование", Объект.Наименование);
	
	Реквизиты = Объект.ДополнительныеРеквизиты;
	
	СтрокиТЧ = Реквизиты.НайтиСтроки(Новый Структура("Имя","Токен"));
	Если СтрокиТЧ.Количество() = 1 Тогда
		РеквизитТокен = СтрокиТЧ[0];
	Иначе
		РеквизитТокен = Реквизиты.Добавить();
		РеквизитТокен.Имя = "Токен";
	КонецЕсли;
	
	РеквизитТокен.Строка = Токен;
	
	Вебхук = тг_Сервер.ПолучитьВебхук(Токен);
			
КонецПроцедуры

&НаСервере
Процедура ВебхукПриИзмененииНаСервере()
	тг_Сервер.СохранитьВебхук(Токен, Вебхук + "/" + Объект.Код);
КонецПроцедуры

#КонецОбласти
