#Область ПрограммныйИнтерфейс

// Получить правило метода телеграм.
// 
// Параметры:
//  ИмяМетода - Строка - Объект телеграм
// 
// Возвращаемое значение:
//  Структура - Получить правило метода телеграм:
// * Метод - Строка - Метод API Telegram
// * Поля - Массив - Массив полей
//
Функция ПолучитьПравилоМетода(ИмяМетода) Экспорт

    Результат = Новый Структура("Метод,Поля","",Новый Массив);
	
	Попытка
		Выполнить("Правило_" + ИмяМетода + "(Результат)");
	Исключение
		Результат.Метод = ИмяМетода;
		Загрушка = Истина;
	КонецПопытки;	

	Возврат Результат;
	
КонецФункции

// Типы чатов.
// Type of chat, can be either “private”, “group”, “supergroup” or “channel”
// см. https://core.telegram.org/bots/api#chat
// 
// Возвращаемое значение:
//  Соответствие - Типы чатов
Функция ТипыЧатов() Экспорт
	
	ТипыЧатов = Новый Соответствие;
	ТипыЧатов.Вставить("private"	, Перечисления.тг_ТипыОбъектов.Пользователь);
	ТипыЧатов.Вставить("group"		, Перечисления.тг_ТипыОбъектов.Группа);
	ТипыЧатов.Вставить("supergroup"	, Перечисления.тг_ТипыОбъектов.ГруппаКанала);
	ТипыЧатов.Вставить("channel"	, Перечисления.тг_ТипыОбъектов.Канал);
	
	Возврат ТипыЧатов;
	
КонецФункции

Функция ТипыИзображения() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("image/gif"					, Истина);
	Результат.Вставить("image/jpeg"					, Истина);
	Результат.Вставить("image/pjpeg"				, Истина);
	Результат.Вставить("image/png"					, Истина);
	Результат.Вставить("image/svg+xml"				, Истина);
	Результат.Вставить("image/tiff"					, Истина);
	Результат.Вставить("image/vnd.microsoft.icon"	, Истина);
	Результат.Вставить("image/vnd.wap.wbmp"			, Истина);
	Результат.Вставить("image/webp"					, Истина);

	Возврат Результат;
	
КонецФункции

Функция ТипыАудио() Экспорт
	
	Результат = Новый Соответствие;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьБотаСВ() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ИдентификаторБота = ХранилищеОбщихНастроек.Загрузить("СД_БотТелеграм",,,"ВсеПользователи");
	
	Если ИдентификаторБота = Неопределено Тогда
		
		СвойстваБота = Новый Структура;
		СвойстваБота.Вставить("Имя"			,"СД_БотТелеграм");
		СвойстваБота.Вставить("Картинка"	, БиблиотекаКартинок.ПользовательБезФотографии);
		СвойстваБота.Вставить("ПолноеИмя"	, "Бот телеграм");
		СвойстваБота.Вставить("Внешний"		, Истина);
		
		Бот = СистемаВзаимодействия.СоздатьПользователя();
		ЗаполнитьЗначенияСвойств(Бот,СвойстваБота);
		Бот.Записать();
		
		ИдентификаторБота = Бот.Идентификатор;
		
		ХранилищеОбщихНастроек.Сохранить("СД_БотТелеграм",,ИдентификаторБота,,"ВсеПользователи");
		
	КонецЕсли;

	Возврат СистемаВзаимодействия.ПолучитьПользователя(ИдентификаторБота);
	
КонецФункции

Функция ЦветКодовый() Экспорт
	Возврат Новый Цвет(28,85,174);	
КонецФункции

Функция ШрифтКодовый() Экспорт
	Возврат Новый Шрифт(,,,,,,80);	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПоле()
	
	Результат = Новый Структура;
	Результат.Вставить("Имя"			, "");
	Результат.Вставить("Параметр"		, "");
	Результат.Вставить("Тип"			, "Строка");
	Результат.Вставить("Значение"		, );
	Результат.Вставить("Обязательный"	, Ложь);
	
	Возврат Результат;
			
КонецФункции

#Область ОписаниеМетодов

// Правило "Данные бота".
// См. https://core.telegram.org/bots/api#getme
//
//@skip-check module-unused-method
Процедура Правило_ДанныеБота(Ответ)
	
	Ответ.Метод = "getMe";
	   
КонецПроцедуры

// Правило "Отправить Текстовое сообщение".
//См. https://core.telegram.org/bots/api#sendmessage
//
//@skip-check module-unused-method
Процедура Правило_ТекстовоеСообщение_Отправить(Ответ)

	Ответ.Метод = "sendMessage";
		
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдЧата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "Текст";
	Поле.Параметр 		= "text";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Формат";
	Поле.Параметр 		= "parse_mode";
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Сущности";
	Поле.Параметр 		= "entities";
	Поле.Тип			= "JSON";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ПросмотрСсылок";
	Поле.Параметр 		= "disable_web_page_preview";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Оповещение";
	Поле.Значение		= Истина;
	Поле.Параметр 		= "disable_notification";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдПересылаемогоСообщения";
	Поле.Параметр 		= "reply_to_message_id";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ПересылаемоеСообщениеОтправлятьВсегда";
	Поле.Параметр 		= "allow_sending_without_reply";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Защита";
	Поле.Параметр 		= "protect_content";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Клавиатура";
	Поле.Параметр 		= "reply_markup";
	Поле.Тип			= "JSON";
	
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

#КонецОбласти

//@skip-check module-unused-method
Процедура Правило_ТекстовоеСообщение_Обновить(Ответ)

	Ответ.Метод = "editMessageText";
		
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдЧата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдСообщения";
	Поле.Параметр 		= "message_id";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Текст";
	Поле.Параметр 		= "text";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдВстоенногоСообщения";
	Поле.Параметр 		= "inline_message_id";
	
	Ответ.Поля.Добавить(Поле);
	

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Формат";
	Поле.Параметр 		= "parse_mode";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Сущности";
	Поле.Параметр 		= "entities";
	Поле.Тип			= "JSON";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ПросмотрСсылок";
	Поле.Параметр 		= "disable_web_page_preview";
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "Клавиатура";
	Поле.Параметр 		= "reply_markup";
	Поле.Тип			= "JSON";
	
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_ТекстовоеСообщение_Удалить(Ответ)

	Ответ.Метод = "deleteMessage";
		
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИД_Чата";
	Поле.Параметр 		= "chat_id";
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИД_Сообщения";
	Поле.Параметр 		= "message_id";
	
	Ответ.Поля.Добавить(Поле);
	
КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_ДанныеВебХук(Ответ)
	
	Ответ.Метод = "getWebhookInfo";
	
КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_УстановитьВебХук(Ответ)
	
	Ответ.Метод = "setWebhook";

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Адрес";
	Поле.Параметр 		= "url";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Сертификат";
	Поле.Параметр 		= "certificate";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "IPАдрес";
	Поле.Параметр 		= "ip_address";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "МаксСоединений";
	Поле.Параметр 		= "max_connections";
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "СписокСобытий";
	Поле.Параметр 		= "allowed_updates";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "УдалитьСобытия";
	Поле.Параметр 		= "drop_pending_updates";
	
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_УдалитьВебхук(Ответ)
	
	Ответ.Метод = "deleteWebhook";

	Поле = ПолучитьПоле();
	Поле.Имя 			= "УдалитьСобытия";
	Поле.Параметр 		= "drop_pending_updates";
	
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_ДанныеПользователя(Ответ)
	
	Ответ.Метод = "getChatMember";
	   
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИД_Чата";
	Поле.Параметр 		= "chat_id";
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИД_Пользователя";
	Поле.Параметр 		= "user_id";
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_ДанныеЧата(Ответ)
	
	Ответ.Метод = "getChat";
	   
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИД_Чата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_УстановитьЗаголовокЧата(Ответ)
	
	Ответ.Метод = "setChatTitle";
	   
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИД_Чата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Заголовок";
	Поле.Параметр 		= "title";
	Поле.Обязательный	= Истина;
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_УстановитьОписаниеЧата(Ответ)
	
	Ответ.Метод = "setChatDescription";
	   
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИД_Чата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Описание";
	Поле.Параметр 		= "description";
	Поле.Обязательный	= Истина;
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_Изображение_Отправить(Ответ)

	Ответ.Метод = "sendPhoto";
		
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдЧата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Фото";
	Поле.Параметр 		= "photo";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Подпись";
	Поле.Параметр 		= "caption";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Формат";
	Поле.Параметр 		= "parse_mode";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Сущности";
	Поле.Параметр 		= "caption_entities";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Оповещение";
	Поле.Параметр 		= "disable_notification";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдПересылаемогоСообщения";
	Поле.Параметр 		= "reply_to_message_id";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ПересылаемоеСообщение_ОтправлятьВсегда";
	Поле.Параметр 		= "allow_sending_without_reply";
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "Клавиатура";
	Поле.Параметр 		= "reply_markup";
	
	Ответ.Поля.Добавить(Поле);
	
КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_Аудиофайл_Отправить(Ответ)

	Ответ.Метод = "sendAudio";
		
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдЧата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Фото";
	Поле.Параметр 		= "photo";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Подпись";
	Поле.Параметр 		= "caption";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Формат";
	Поле.Параметр 		= "parse_mode";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Сущности";
	Поле.Параметр 		= "caption_entities";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Оповещение";
	Поле.Параметр 		= "disable_notification";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдПересылаемогоСообщения";
	Поле.Параметр 		= "reply_to_message_id";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ПересылаемоеСообщение_ОтправлятьВсегда";
	Поле.Параметр 		= "allow_sending_without_reply";
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "Клавиатура";
	Поле.Параметр 		= "reply_markup";
	
	Ответ.Поля.Добавить(Поле);
	
КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_Документ_Отправить(Ответ)

	Ответ.Метод = "sendDocument";
		
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдЧата";
	Поле.Параметр 		= "chat_id";
	Поле.Обязательный	= Истина;
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Фото";
	Поле.Параметр 		= "photo";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Подпись";
	Поле.Параметр 		= "caption";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Формат";
	Поле.Параметр 		= "parse_mode";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Сущности";
	Поле.Параметр 		= "caption_entities";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Оповещение";
	Поле.Параметр 		= "disable_notification";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдПересылаемогоСообщения";
	Поле.Параметр 		= "reply_to_message_id";
	
	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ПересылаемоеСообщение_ОтправлятьВсегда";
	Поле.Параметр 		= "allow_sending_without_reply";
	
	Ответ.Поля.Добавить(Поле);
	
	Поле = ПолучитьПоле();
	Поле.Имя 			= "Клавиатура";
	Поле.Параметр 		= "reply_markup";
	
	Ответ.Поля.Добавить(Поле);
	
КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_ПолучитьФайл(Ответ)
	
	Ответ.Метод = "getFile";
	   
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдФайла";
	Поле.Параметр 		= "file_id";
	Поле.Обязательный	= Истина;
	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_ИзменитьПодписьСообщения(Ответ)
	
	Ответ.Метод = "editMessageCaption";
	   
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдЧата";
	Поле.Параметр 		= "chat_id";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдСообщения";
	Поле.Параметр 		= "message_id";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдВстоенногоСообщения";
	Поле.Параметр 		= "inline_message_id";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Подпись";
	Поле.Параметр 		= "caption";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Формат";
	Поле.Параметр 		= "parse_mode";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Сущности";
	Поле.Параметр 		= "caption_entities";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Клавиатура";
	Поле.Параметр 		= "reply_markup";
   	Поле.Тип			= "JSON";

	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

//@skip-check module-unused-method
Процедура Правило_УстановитьНазваниеАдминистратораЧата(Ответ)
	
	Ответ.Метод = "setChatAdministratorCustomTitle";
	   
	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдЧата";
	Поле.Параметр 		= "chat_id";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "ИдПользователя";
	Поле.Параметр 		= "user_id";

	Ответ.Поля.Добавить(Поле);

	Поле = ПолучитьПоле();
	Поле.Имя 			= "Название";
	Поле.Параметр 		= "custom_title";

	Ответ.Поля.Добавить(Поле);

КонецПроцедуры

#КонецОбласти