
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	//ОткрытьФорму("РегистрСведений.СД_ТелеграмЛоги.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаЧаты Тогда

	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьЖурнал(Команда)
	ОчиститьЖурналНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДоступныеТипы1С(Команда)
	ОткрытьФорму("РегистрСведений.тг_ДоступныеТипыОбъектов1С.Форма.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОчиститьЖурналНаСервере()
//	РегистрыСведений.СД_ТелеграмЛоги.ОчиститьЖурналРезультатов();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементов(Форма)

//	Элементы = Форма.Элементы;
//	ТокенПравильный = ЗначениеЗаполнено(Форма.Токен);
	
КонецПроцедуры

#КонецОбласти