
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыОбъекта = Справочники.тг_Объект.ПолучитьРеквизиты(Объект.Ссылка);
	
	РеквизитыОбъекта.Свойство("Описание", Описание);					
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеЧата = тг_Сервер.ПолучитьДанныеЧата(ТекущийОбъект.Ссылка);
		
	Если ДанныеЧата <> Неопределено Тогда
			
		Если ДанныеЧата["title"] <> ТекущийОбъект.Наименование Тогда
			тг_Сервер.УстановитьЗаголовокЧата(ТекущийОбъект.Ссылка, ТекущийОбъект.Наименование);
		КонецЕсли;
			
		Если ДанныеЧата["description"] <> Описание Тогда
			тг_Сервер.УстановитьОписаниеЧата(ТекущийОбъект.Ссылка, Описание);
		КонецЕсли;
			
	КонецЕсли;
		
	СтрокаТЧ = ТекущийОбъект.ДополнительныеРеквизиты.Найти("Описание", "Имя");

	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = ТекущийОбъект.ДополнительныеРеквизиты.Добавить();
		СтрокаТЧ.Имя = "Описание";
	КонецЕсли;
			
	СтрокаТЧ.Строка = Описание;

КонецПроцедуры

#КонецОбласти