#Область ПрограммныйИнтерфейс

// Предназначена для вызова из обработчика ПриНачалеРаботыСистемы модулей управляемого и обычного приложения.
//
Процедура ПриНачалеРаботыСистемы() Экспорт

	Если СистемаВзаимодействия.ИспользованиеДоступно() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтправкиСообщенияСВ", ЭтотОбъект);
		СистемаВзаимодействия.ПодключитьОбработчикПослеОтправкиСообщения(ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

// Обработка отправки сообщения СВ.
// 
// Параметры:
// СообщениеСВ 	- СообщениеСистемыВзаимодействия - СообщениеСистемыВзаимодействия
// ОбсуждениеСВ - ОбсуждениеСистемыВзаимодействия - ОбсуждениеСистемыВзаимодействия
// ДополнительныеПараметры - Произвольный - значение, которое было указано при создании объекта ОписаниеОповещения
Процедура ОбработкаОтправкиСообщенияСВ(СообщениеСВ, ОбсуждениеСВ, ДополнительныеПараметры) Экспорт

	тг_ВызовСервера.ПослеОтправкиСообщенияСВ(СообщениеСВ.Идентификатор);

КонецПроцедуры

#КонецОбласти